{
	"team": [{
		"name": "Judy Ortega",
		"bio": "Originally from Tucson, Arizona, Judy moved to Dallas, TX in 2007. Shortly upon arrival, she began a career with Toni &amp; Guy North America, and furthering herself into mentoring with education. Judy carefully consults &amp; studies the client’s personal &amp; professional lifestyle, before selecting a style to focus towards. Bilingual in both Spanish and English. She is an absolute asset to our essensuals London team. Judy’s style is soft, yet cutting-edge, which pairs up with any lifestyle. This combo allows flexibility for each individual client.",
		"title": "Stylist"
	},{
		"name": "Amber Smith",
		"bio": "A former dance teacher from Plano, Amber has been doing hair for four years. Amber specializes in highlights and  color that looks effortless and natural.",
		"title": "Chemical Technician"
	},{
		"name": "Michael Beck",
		"bio": "Michael’s years of experience in education and management has made him a great leader that takes great pride in the salon. “During consultations, it is most important to pay close attention to what a client has to say, in order to create the best look” - Michael says, always making each and every client a priority. His precision and skill keep his haircuts timeless, effortless to style and well planned.",
		"title": "Partner/General Manager"
	},{
		"name": "Gabriel Ontiveros",
		"bio": "Gabriel’s vast experience with salons and Toni &amp; Guy academies nationwide inspired himself and his partners to open the first essensuals London in TX. His sixteen years as a colourist, educator, manager &amp; artistic director nationwide has enabled the salon to attract many top professionals from Dallas and across the country. Gabriel and his partners carefully chose their staff upon continued education &amp; elite talent. Mr. Ontiveros has been all over the world educating &amp; creating classic to fashion forward hair colour techniques.",
		"title": "Partner/Chemical Director"
	},{
		"name": "Roman Becerra",
		"bio": "Roman first mentored and inspired by his father Alfredo Becerra and his family. It has been his lifelong passion to carry on this legacy. With over ten years’ experience in leading education, traveling both domestically and abroad, educating on and off stage. His brilliant demeanor and professionalism combined with his genuine love for hair makes him an absolute necessity. Leading the salon in education his meticulous approach to each and every haircut covers all fashion trends from classy chic to creating the next hottest trend.",
		"title": "Partner/Salon Director"
	},{
		"name": "Dianne Becerra",
		"bio": "Dianne is truly amazing. She can handle any situation, whether it is raising a son, managing, art directing, or event planning. She motivates our team to get involved in local events, fashion shows, and advanced education, to name a few. Nine years hairdressing experience, seven years leading in education. Passion for backstage work in photo shoots, fashion shows, weddings, and charities.",
		"title": "Premiere Stylist/Event Coordinator/PR Director"
	},{
		"name": "Teresa Taponpanh",
		"bio": "Inspired by mentors from Hairdressing school, Teresa chose to work at Essensuals London, which she believes fosters an environment of advanced education and growth. When Teresa isn't making people look amazing, she's tending to her four-year-old, studying astrology, or cruising the internet for fashion blogs, current trends, and how to live a healthy and happy lifestyle.",
		"title": "Premiere Technician"
	},{
		"name": "Amber Smith",
		"bio": "A former dance teacher from Plano, Amber has been doing hair for four years. Amber specializes in highlights and color that looks effortless and natural.",
		"title": "Premiere Technician"
	},{
		"name": "Ashley Ray",
		"bio": "Born and raised in Joplin, MO. Ashley Ray moved to Dallas in 2007. Her free time includes playing video games with her Fiancé and spending time with her dog, Digit.",
		"title": "Premiere Stylist"
	},{
		"name": "Chelsea Sica",
		"bio": "Chelsea is an innovative and classy lady with a vast thirst for knowledge. Always pushing herself to rise above and beyond she plays an integral part in our salon. Chelsea is patient and calm, which is key to a successful hairdresser. With over seven years’ experience in the industry, styling and educating, she loves to push styles to the absolute edge.",
		"title": "Premiere Stylist"
	},{
		"name": "Claudia Rodas",
		"bio": "Claudia has 11 years’ experience in the industry. Styling and finishing hair. Originally from Honduras, she represents a strong international presence. Her fun outgoing spirit makes for a memorable experience for anyone that meets her... Her passion for hair shines through both in the salon and doing Runway Shows, Photography shoots and mentor to upcoming stylist and fellow co-workers in education and motivation.",
		"title": "Premiere Stylist"
	},{
		"name": "Tamara Chan",
		"bio": "Tamara knew she wanted to do hair from the time she was seven, constantly begging her mom's friend for some time so she could brush her long locks. With over 20 years of experience, Tamara brings both technical excellence and a passion for hair colour to every client that sits in her chair. It is not only her extensive professional experience that sets her apart, but her genuine enthusiasm for her career. Positivity, leadership, and a motivational attitude attribute to her success and she says, &quot;I bring them to work everyday.&quot; Tamara strives to invoke confidence within every client and whatever a client brings to her chair, they will always leave happy and satisfied.",
		"title": "Premiere Stylist"
	},{
		"name": "Andrew Gentle",
		"bio": "Andrew has 9 years in hairdressing, 8 of those with Toni and Guy, 5 years in education and management. He is continually pursuing knowledge in the field of entrepreneurship and management as it pertains to hairdressing. Andrew is a Plano native. He went to Plano schools and then SMU for college. He is heavy on physical, nutritional, and spiritual health.",
		"title": "Chemical Technician"
	}]
}